Masmiseim36/nxpSDK/boards/mekmimx8qm/driver_examples/tpm/combine_pwm/cm4_core0/pin_mux.h
/*
 * Copyright 2017-2018 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */


#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

#include "board.h"

/***********************************************************************************************************************
 * Definitions
 **********************************************************************************************************************/

/* M40_I2C0_SCL (number AM44), FTDI_M40_UART0_RX */
#define BOARD_INITPINS_FTDI_M40_UART0_RX_PERIPHERAL                   M40__UART0   /*!< Device name: M40__UART0 */
#define BOARD_INITPINS_FTDI_M40_UART0_RX_SIGNAL                          uart_rx   /*!< M40__UART0 signal: uart_rx */
#define BOARD_INITPINS_FTDI_M40_UART0_RX_PIN_NAME                   M40_I2C0_SCL   /*!< Pin name */
#define BOARD_INITPINS_FTDI_M40_UART0_RX_PIN_FUNCTION_ID       SC_P_M40_I2C0_SCL   /*!< Pin function id */
#define BOARD_INITPINS_FTDI_M40_UART0_RX_LABEL               "FTDI_M40_UART0_RX"   /*!< Label */
#define BOARD_INITPINS_FTDI_M40_UART0_RX_NAME                "FTDI_M40_UART0_RX"   /*!< Identifier name */

/* M40_I2C0_SDA (number AU51), FTDI_M40_UART0_TX */
#define BOARD_INITPINS_FTDI_M40_UART0_TX_PERIPHERAL                   M40__UART0   /*!< Device name: M40__UART0 */
#define BOARD_INITPINS_FTDI_M40_UART0_TX_SIGNAL                          uart_tx   /*!< M40__UART0 signal: uart_tx */
#define BOARD_INITPINS_FTDI_M40_UART0_TX_PIN_NAME                   M40_I2C0_SDA   /*!< Pin name */
#define BOARD_INITPINS_FTDI_M40_UART0_TX_PIN_FUNCTION_ID       SC_P_M40_I2C0_SDA   /*!< Pin function id */
#define BOARD_INITPINS_FTDI_M40_UART0_TX_LABEL               "FTDI_M40_UART0_TX"   /*!< Label */
#define BOARD_INITPINS_FTDI_M40_UART0_TX_NAME                "FTDI_M40_UART0_TX"   /*!< Identifier name */

/* M40_GPIO0_00 (number AR47), BB_ARD_MIK_UART3_RX/J20A[34] */
#define BOARD_INITPINS_BB_ARD_MIK_UART3_RX_PERIPHERAL                  M40__TPM0   /*!< Device name: M40__TPM0 */
#define BOARD_INITPINS_BB_ARD_MIK_UART3_RX_SIGNAL                         tpm_ch   /*!< M40__TPM0 signal: tpm_ch */
#define BOARD_INITPINS_BB_ARD_MIK_UART3_RX_CHANNEL                             0   /*!< M40__TPM0 tpm_ch channel: 0 */
#define BOARD_INITPINS_BB_ARD_MIK_UART3_RX_PIN_NAME                 M40_GPIO0_00   /*!< Pin name */
#define BOARD_INITPINS_BB_ARD_MIK_UART3_RX_PIN_FUNCTION_ID     SC_P_M40_GPIO0_00   /*!< Pin function id */
#define BOARD_INITPINS_BB_ARD_MIK_UART3_RX_LABEL  "BB_ARD_MIK_UART3_RX/J20A[34]"   /*!< Label */
#define BOARD_INITPINS_BB_ARD_MIK_UART3_RX_NAME            "BB_ARD_MIK_UART3_RX"   /*!< Identifier name */

/* M40_GPIO0_01 (number AU53), BB_ARD_MIK_UART3_TX/J20A[35] */
#define BOARD_INITPINS_BB_ARD_MIK_UART3_TX_PERIPHERAL                  M40__TPM0   /*!< Device name: M40__TPM0 */
#define BOARD_INITPINS_BB_ARD_MIK_UART3_TX_SIGNAL                         tpm_ch   /*!< M40__TPM0 signal: tpm_ch */
#define BOARD_INITPINS_BB_ARD_MIK_UART3_TX_CHANNEL                             1   /*!< M40__TPM0 tpm_ch channel: 1 */
#define BOARD_INITPINS_BB_ARD_MIK_UART3_TX_PIN_NAME                 M40_GPIO0_01   /*!< Pin name */
#define BOARD_INITPINS_BB_ARD_MIK_UART3_TX_PIN_FUNCTION_ID     SC_P_M40_GPIO0_01   /*!< Pin function id */
#define BOARD_INITPINS_BB_ARD_MIK_UART3_TX_LABEL  "BB_ARD_MIK_UART3_TX/J20A[35]"   /*!< Label */
#define BOARD_INITPINS_BB_ARD_MIK_UART3_TX_NAME            "BB_ARD_MIK_UART3_TX"   /*!< Identifier name */

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif


/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 * @param ipc scfw ipchandle.
 *
 */
void BOARD_InitPins(sc_ipc_t ipc);                         /*!< Function assigned for the core: Cortex-M4F[cm4_0] */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
